{
  "title": "如何处理低覆盖率数据？",
  "description": "在使用brain平台数据构建alpha时，覆盖率是一个十分重要的数据参数。它不仅标志着数据的适用范围，而且和alpha能否提交息息相关。...",
  "post_body": "在使用brain平台数据构建alpha时，覆盖率是一个十分重要的数据参数。它不仅标志着数据的适用范围，而且和alpha能否提交息息相关。\n诚然，覆盖率高的data可以通过简单的操作获得较好的表现，但正是因为低覆盖数据的难以处理，使得这些数据构造的alpha往往具有良好的Prod Correlation表现。\n平台上有许许多多的低覆盖率数据。作为一个新手顾问，自然也遇见了这样的问题：低覆盖率数据应该如何处理？\n一、什么是覆盖率（Coverage）？\n在此，不妨让我们先问问大模型吧。\n覆盖率(coverage)通常指的是策略信号在特定股票池(universe)中的覆盖比例。具体来说，它表示策略在某一时间点上对多少比例的股票产生了信号（无论是做多还是做空信号）。\n如果官方解释看不懂的话，我个人的解释是：在某天有多少股票拥有这个数据。例如，假设现在大盘有两个公司，一家是零食公司，另一家是互联网公司。Brain平台对这俩家公司的数据进行了收集，对于return（收益、回报）这个数据来说，俩家公司都有，覆盖率就是100%。而对于“广告支出”这个数据来说，只有零食公司会有广告支出，覆盖率就是50%。\n我们可以在data列表中查看数据的覆盖率，如下图所示。\n二、\n为什么覆盖率很重要？\n上文我已经提到，覆盖率和alpha能否提交息息相关。之所以这么说，是因为它和alpha的重要检验指标——weight有关。所谓weight，个人理解就是你的alpha是否只依赖极个别股票。\n为什么低覆盖会导致高weight（过度依赖个别股票）？就是因为太多股票在某个时间段失去了该数据，导致alpha只能对少数仍有该数据的股票进行操作，从而过度依赖个别股票。\n来看我user期间的使用scl12_buzz和volume创建的一个alpha，pnl如下：\n这个alpha在2022.9.28的weight达到了13%的weight（其实个人感觉突增或者突然平缓大多都很有可能缺乏数据）。我们可以去lab里看看发生甚么事了。\n由图我们可以看出，很有可能是因为2022.9.27覆盖率排名前五的一只股票出现了极端值导致的。我们可以考虑去除这个极端值（当然，这不是这篇文章的主题）也可以对空缺的消息进行回填，从而降低weight完成提交。\n三、如何处理低覆盖率\n对低覆盖率数据的处理，我们可以大致分为两类。对于较高覆盖率（覆盖率>60%）的数据，可以对其进行回填使其覆盖率回到正常水平。以下是一些常见的回填思路。\n1.\n插值技术\n插值技术是通过已知数据点来估算缺失值的方法。在数据集中，当某些值缺失但周围有连续的数据时，插值可以填补这些空白。常见的插值方法包括：\n线性插值\n：在两个已知数据点之间，假设数据是线性变化的，用直线连接这两个点来估算中间值。\n样条插值\n：使用分段多项式函数来拟合数据点，提供更平滑的估算结果。\n多项式插值\n：用一个多项式函数拟合所有已知数据点，适用于复杂变化的数据。\n适用场景\n：时间序列数据（如股票价格、温度记录）中偶尔缺失的值\n2.\n滚动聚合\n滚动聚合是通过滑动窗口对数据进行统计计算，以平滑数据或填补空白。这种方法特别适合处理高频数据或带有噪声的数据。常见的滚动聚合方法包括：\n滚动均值\n：在固定窗口内计算数据的平均值，用于平滑短期波动。\n滚动中位数\n：对窗口内的数据排序后取中间值，减少异常值的影响。\n滚动最大值/最小值\n：在窗口内计算极值，用于识别趋势或异常点。\n适用场景\n：数据波动较大或存在短期噪声时，例如金融市场中高频交易数据的处理。\n3.\n跨字段替代\n跨字段替代是利用其他相关字段的值来估算或替代缺失数据。这种方法依赖于数据之间的相关性，需要深入理解数据集的结构和关系。常见方法包括：\n相关性替代\n：找到与缺失字段高度相关的其他字段，用其值作为替代。例如，用GDP增长率替代缺失的市场增长率。\n模型预测替代\n：通过回归模型或机器学习算法，基于其他字段预测缺失值。\n规则替代\n：根据业务逻辑或规则，用固定值或计算值替代缺失数据。例如，用行业平均值替代缺失的公司数据。\n适用场景\n：数据集中某些字段缺失，但其他字段可以提供足够的信息进行推断。例如，金融数据中某些指标缺失时，可用宏观经济指标替代。\n而对于覆盖率过低数据（覆盖率<60%），在构建alpha时就十分困难。这主要是因为集中风险和其不稳定的表现。虽然有时可以通过回填（backfill）、trade_when()或自定义组（custom groups）来整合这些数据，但单独依赖它们往往难以获得优良的alpha。诸如group_backfill、平滑变换（例如log）或机器学习方法等技术可能会提高其效用。然而，如果PnL（盈亏）图表表现出不稳定的行为（例如水平-垂直-水平模式），则可能表明数据缺乏预测能力，需要采用其他预处理方法，或与更可靠的信号来结合使用。\n个人感觉覆盖率特别低的数据，只能在trade_when和if_else中作为判断条件或者与其他信号组合后使用rank等操作符来优化alpha，很难作为独立信号构建alpha。\n四、操作符和一些具体方法\n在官方的“Weight Coverage common issues and advice”中给出了一些常见方案如下所示。\n尝试：group_count(is_nan(a), market) > 40 ? a : nan。该算子可检测因短时间窗口内数据缺失导致的股票数量异常下降。\n尝试：Ts_backfill(a, 2)，如果数据仅缺失一天。该算子适用于检测因数据更新频率低（如基本面数据）导致的低覆盖率。\n尝试：Ts_backfill(a, 60)，适用于季度更新的基本面数据。该算子可检测依赖新闻的因子中覆盖率的异常变化。\n除了上述常见的三种方案外，你还可以检测NaN值，并使用is_nan()、last_diff_value()、days_from_last_change()等函数复现第三章的回填思路进行回填。\n本人刚成为有条件顾问不久，文章内可能会有纰漏。希望大家不吝赐教。如果觉得文章有帮助，希望给我点个赞。",
  "post_comments": [
    "文章特别好，作者知识非常丰富，我也非常受启发",
    "——“然而，如果PnL（盈亏）图表表现出不稳定的行为（例如水平-垂直-水平模式），则可能表明数据缺乏预测能力，需要采用其他预处理方法，或与更可靠的信号来结合使用。”个人觉得作者的分析非常有道理。如果本身该数据已经表现出了单独使用的不稳定的状态，就是对该信号如何修饰都不会起太大作用，内核已经不太好，外面的壳怎么装饰其实都没什么用的。但是可以作为其他更可靠数据的辅助条件。",
    "点个赞"
  ]
}